% 文件: GM1_1.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

%灰色预测公司的利润
clc,clear  % 详解: 执行语句
syms a b;  % 详解: 执行语句
c=[a,b]';  % 赋值：设置变量 c  % 详解: 赋值：计算表达式并保存到 c  % 详解: 赋值：计算表达式并保存到 c
A=[89677,99215,109655,120333,135823,159878,182321,209407,246619,300670];  % 详解: 赋值：计算表达式并保存到 A
B=cumsum(A);  % 详解: 赋值：将 cumsum(...) 的结果保存到 B
n=length(A);  % 详解: 赋值：将 length(...) 的结果保存到 n
for i=1:(n-1)  % 详解: for 循环：迭代变量 i 遍历 1:(n-1)
   C(i)=0.5*(B(i)+B(i+1));  % 详解: 调用函数：C(i)=0.5*(B(i)+B(i+1))
end  % 详解: 执行语句

D=A;D(1)=[];  % 详解: 赋值：计算表达式并保存到 D
D=D';  % 赋值：设置变量 D  % 详解: 赋值：计算表达式并保存到 D  % 详解: 赋值：计算表达式并保存到 D
E=[-C;ones(1,n-1)];  % 详解: 赋值：计算表达式并保存到 E
c=inv(E*E')*E*D;  % 矩阵求逆  % 详解: 赋值：将 inv(...) 的结果保存到 c  % 详解: 赋值：将 inv(...) 的结果保存到 c
c=c';  % 赋值：设置变量 c  % 详解: 赋值：计算表达式并保存到 c  % 详解: 赋值：计算表达式并保存到 c
a=c(1);b=c(2);  % 详解: 赋值：将 c(...) 的结果保存到 a

F=[];F(1)=A(1);  % 详解: 赋值：计算表达式并保存到 F
for i=2:(n+10)  % 详解: for 循环：迭代变量 i 遍历 2:(n+10)
    F(i)=(A(1)-b/a)/exp(a*(i-1))+b/a;  % 详解: 执行语句
end  % 详解: 执行语句
G=[];G(1)=A(1);  % 详解: 赋值：计算表达式并保存到 G
for i=2:(n+10)  % 详解: for 循环：迭代变量 i 遍历 2:(n+10)
    G(i)=F(i)-F(i-1);  % 详解: 调用函数：G(i)=F(i)-F(i-1)
end  % 详解: 执行语句
t1=1999:2008;  % 详解: 赋值：计算表达式并保存到 t1
t2=1999:2018;  % 详解: 赋值：计算表达式并保存到 t2
G  % 详解: 执行语句
plot(t1,A,'o',t2,G);  % 详解: 调用函数：plot(t1,A,'o',t2,G)
xlabel('年份');ylabel('利润');  % 详解: 调用函数：xlabel('年份');ylabel('利润')





