% 文件: L01p_e.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function [x,f]=L01p_e(c,A,b,N)  % 详解: 函数定义：L01p_e(c,A,b,N), 返回：x,f


if nargin<4,N=0;end  % 详解: 条件判断：if (nargin<4,N=0;end)
c=c(:);b=b(:);  % 详解: 赋值：将 c(...) 的结果保存到 c
[m,n]=size(A);x=[];f=abs(c')*ones(n,1);i=1;  % 创建全 1 矩阵/数组  % 详解: 创建全 1 矩阵/数组  % 详解: 创建全 1 矩阵/数组
while i<=2^n  % 详解: while 循环：当 (i<=2^n) 为真时迭代
   B=de2bi(i-1,n)';  % 赋值：设置变量 B  % 详解: 赋值：将 de2bi(...) 的结果保存到 B  % 详解: 赋值：将 de2bi(...) 的结果保存到 B
   t=A*B-b;t11=find(t(1:N,:)~=0);  % 详解: 赋值：计算表达式并保存到 t
   t12=find(t(N+1:m,:)>0);t1=[t11;t12];  % 详解: 赋值：将 find(...) 的结果保存到 t12
   if isempty(t1)  % 详解: 条件判断：if (isempty(t1))
      f=min([f,c'*B]);  % 统计：最大/最小值  % 详解: 赋值：将 min(...) 的结果保存到 f  % 详解: 赋值：将 min(...) 的结果保存到 f
      if c'*B==f,x=B;end  % 条件判断：if 分支开始  % 详解: 条件判断：if (c'*B==f,x=B;end)  % 详解: 条件判断：if (c'*B==f,x=B;end  % 条件判断：if 分支开始  % 详解: 条件判断：if (c'*B==f,x=B;end))
   end  % 详解: 执行语句
   i=i+1;  % 详解: 赋值：计算表达式并保存到 i
end  % 详解: 执行语句





