% 文件: L01p_ie.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function [x,f]=L01p_ie(c,A,b,N)  % 详解: 函数定义：L01p_ie(c,A,b,N), 返回：x,f


if nargin<4,N=0;end  % 详解: 条件判断：if (nargin<4,N=0;end)
c=c(:);b=b(:);  % 详解: 赋值：将 c(...) 的结果保存到 c
A=[-A(1:N,:);A];b=[-b(1:N);b];  % 详解: 赋值：计算表达式并保存到 A
[m,n]=size(A);x=[];f=abs(c')*ones(n,1);  % 创建全 1 矩阵/数组  % 详解: 创建全 1 矩阵/数组  % 详解: 创建全 1 矩阵/数组
A=[c';A];b=[f;b];i=1;  % 赋值：设置变量 A  % 详解: 赋值：计算表达式并保存到 A  % 详解: 赋值：计算表达式并保存到 A
while i<=2^n  % 详解: while 循环：当 (i<=2^n) 为真时迭代
   B=de2bi(i-1,n)';  % 赋值：设置变量 B  % 详解: 赋值：将 de2bi(...) 的结果保存到 B  % 详解: 赋值：将 de2bi(...) 的结果保存到 B
   j=1;t1=A(j,:)*B-b(j);  % 详解: 赋值：计算表达式并保存到 j
   while(t1<=0&j<m+1)  % 详解: 调用函数：while(t1<=0&j<m+1)
      j=j+1;t1=A(j,:)*B-b(j);  % 详解: 赋值：计算表达式并保存到 j
      if t1>0,j=1;end  % 详解: 条件判断：if (t1>0,j=1;end)
   end  % 详解: 执行语句
   if j==m+1  % 详解: 条件判断：if (j==m+1)
      x=B;f=c'*B;  % 赋值：设置变量 x  % 详解: 赋值：计算表达式并保存到 x  % 详解: 赋值：计算表达式并保存到 x
      b(1)=min([b(1),f]);  % 详解: 调用函数：b(1)=min([b(1),f])
   end  % 详解: 执行语句
   i=i+1;  % 详解: 赋值：计算表达式并保存到 i
end  % 详解: 执行语句





