% 文件: f12.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f12=f12(x)  % 详解: 执行语句
Bound=[-50 50];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f12 = Bound;  % 详解: 赋值：计算表达式并保存到 f12
else  % 详解: 条件判断：else 分支
    y=1+(x+1)./4;  % 详解: 赋值：计算表达式并保存到 y
    a=x>10;  % 详解: 赋值：计算表达式并保存到 a
    b=x<-10;  % 详解: 赋值：计算表达式并保存到 b
    [row col]=size(x);  % 详解: 获取向量/矩阵尺寸

    y1=y(1:row-1,:);  % 详解: 赋值：将 y(...) 的结果保存到 y1
    y2=y(2:row,:);  % 详解: 赋值：将 y(...) 的结果保存到 y2

    usum=sum(a*.100.*((x-10)).^4)+sum(b*.100.*(x+10).^4);  % 详解: 赋值：将 sum(...) 的结果保存到 usum
    f12=(10*sin(pi*y(1,:)).^2+sum((y1-1).^2.*(1+10*sin(pi.*y2).^2))+(y(row,:)-1).^2)*(pi/30)+usum;  % 详解: 赋值：计算表达式并保存到 f12
end  % 详解: 执行语句



