% 文件: f13.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f13=f13(x)  % 详解: 执行语句
Bound=[-50 50];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f13 = Bound;  % 详解: 赋值：计算表达式并保存到 f13
else  % 详解: 条件判断：else 分支
    y=1+(x+1)./4;  % 详解: 赋值：计算表达式并保存到 y
    a=x>5;  % 详解: 赋值：计算表达式并保存到 a
    b=x<-5;  % 详解: 赋值：计算表达式并保存到 b
    [row col]=size(x);  % 详解: 获取向量/矩阵尺寸

    y1=x(1:row-1,:);  % 详解: 赋值：将 x(...) 的结果保存到 y1
    y2=x(2:row,:);  % 详解: 赋值：将 x(...) 的结果保存到 y2

    usum=sum(a*.100.*((x-10)).^4)+sum(b*.100.*(x+10).^4);  % 详解: 赋值：将 sum(...) 的结果保存到 usum
    a=sum((y1-1).^2.*(1+sin(3*pi.*y2).^2));  % 详解: 赋值：将 sum(...) 的结果保存到 a
    b=(x(row,:)-1).^2.*(1+sin(2*pi.*x(row,:)).^2);  % 详解: 赋值：计算表达式并保存到 b
    f13=(sin(3*pi*x(1,:)).^2 + a + b)*.1+usum;  % 详解: 赋值：计算表达式并保存到 f13
end  % 详解: 执行语句



