% 文件: f14.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f14=f14(x)  % 详解: 执行语句

Bound=[-65.536 65.536];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f14 = Bound;  % 详解: 赋值：计算表达式并保存到 f14
else  % 详解: 条件判断：else 分支
aij=[   -32 -16 0 16 32 -32 -16 0 16 32 -32 -16 0 16 32 -32 -16 0 16 32 -32 -16 0 16 32;  % 详解: 赋值：计算表达式并保存到 aij
    -32 -32 -32 -32 -32 -16 -16 -16 -16 -16 0 0 0 0 0 16 16 16 16 16 32 32 32 32 32];  % 详解: 执行语句

x1=x(1,:)*ones(1,25);  % 详解: 赋值：将 x(...) 的结果保存到 x1
x2=x(2,:)*ones(1,25);  % 详解: 赋值：将 x(...) 的结果保存到 x2

j=cumsum(ones(1,25));  % 详解: 赋值：将 cumsum(...) 的结果保存到 j

f14=1/(1/500+sum(1./(j+(x1-aij(1,:)).^6+(x2-aij(2,:)).^6)));  % 详解: 赋值：计算表达式并保存到 f14
end  % 详解: 执行语句








