% 文件: f15.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f15=f15(x)  % 详解: 执行语句
Bound=[-5 5];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f15 = Bound;  % 详解: 赋值：计算表达式并保存到 f15
else  % 详解: 条件判断：else 分支
    ai=[.1957 .1947 .1735 .16 .0844 .0627 .0456 .0342 .0323 .0235 .0246];  % 详解: 赋值：计算表达式并保存到 ai
    bi=1./[.25 .5 1 2 4 6 8 10 12 14 16];  % 详解: 赋值：计算表达式并保存到 bi

    f15=sum((ai-x(1,:).*(bi.^2+bi.*x(2,:))./(bi.^2+bi.*x(3,:)+x(4,:))).^2);  % 详解: 赋值：将 sum(...) 的结果保存到 f15
end  % 详解: 执行语句








