% 文件: f19.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f19=f19(x)  % 详解: 执行语句
Bound=[0 1];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f19 = Bound;  % 详解: 赋值：计算表达式并保存到 f19
else  % 详解: 条件判断：else 分支
aij=[3 10 30;  % 详解: 赋值：计算表达式并保存到 aij
    .1 10 35;  % 详解: 执行语句
    3 10 30;  % 详解: 执行语句
    .1 10 35];  % 详解: 执行语句
ci=[1 1.2 3 3.2];  % 详解: 赋值：计算表达式并保存到 ci
pij=[.3689 .1170 .2673;  % 详解: 赋值：计算表达式并保存到 pij
     .4699 .4387 .7470;  % 详解: 执行语句
     .1091 .8732 .5547;  % 详解: 执行语句
     .03815 .5743 .8828];  % 详解: 执行语句
 
 X=[x x x x];  % 详解: 赋值：计算表达式并保存到 X
 
f19=-sum(ci.*exp(-sum(aij'.*(X-pij').^2)));  % 详解: 赋值：计算表达式并保存到 f19
end  % 详解: 执行语句
 
 








