% 文件: f20.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f20=f20(x)  % 详解: 执行语句
Bound=[0 1];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f20 = Bound;  % 详解: 赋值：计算表达式并保存到 f20
else  % 详解: 条件判断：else 分支
aij=[10 3 17 3.5 1.7 8;  % 详解: 赋值：计算表达式并保存到 aij
    .05 10 17 .1 8 14;  % 详解: 执行语句
    3 3.5 1.7 10 17 8;  % 详解: 执行语句
    17 8 .05 10 .1 14];  % 详解: 执行语句
ci=[1 1.2 3 3.2];  % 详解: 赋值：计算表达式并保存到 ci
pij=[.1312 .1686 .5569 .0124 .8283 .5886;  % 详解: 赋值：计算表达式并保存到 pij
     .2329 .4135 .8307 .3736 .1004 .9991;  % 详解: 执行语句
     .2348 .1415 .3522 .2883 .3047 .6650;  % 详解: 执行语句
     .4047 .8828 .8732 .5743 .1091 .0381];  % 详解: 执行语句
 
 X=[x x x x];  % 详解: 赋值：计算表达式并保存到 X
 
f20=-sum(ci.*exp(-sum(aij'.*(X-pij').^2)));  % 详解: 赋值：计算表达式并保存到 f20
end  % 详解: 执行语句
 
 








