% 文件: f21.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f21=f21(x)  % 详解: 执行语句
Bound=[0 10];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f21 = Bound;  % 详解: 赋值：计算表达式并保存到 f21
else  % 详解: 条件判断：else 分支
aij=[4 4 4 4;  % 详解: 赋值：计算表达式并保存到 aij
     1 1 1 1;  % 详解: 执行语句
     8 8 8 8;  % 详解: 执行语句
     6 6 6 6;  % 详解: 执行语句
     3 7 3 7];  % 详解: 执行语句
ci=[.1 .2 .2 .4 .4];  % 详解: 赋值：计算表达式并保存到 ci

f21=0;  % 详解: 赋值：计算表达式并保存到 f21

for i=1:5  % 详解: for 循环：迭代变量 i 遍历 1:5
    f21=f21+(norm(x-aij(i,:)').^2+ci(:,i))^-1;  % 赋值：设置变量 f21  % 详解: 赋值：计算表达式并保存到 f21  % 详解: 赋值：计算表达式并保存到 f21
end  % 详解: 执行语句

f21=-f21;  % 详解: 赋值：计算表达式并保存到 f21

end  % 详解: 执行语句
 
 








