% 文件: f23.m
% 说明: 自动添加的注释占位，请根据需要补充。
% 生成: 2025-08-31 23:06
% 注释: 本文件头由脚本自动添加

function f23=f23(x)  % 详解: 执行语句
Bound=[0 10];  % 详解: 赋值：计算表达式并保存到 Bound

if nargin==0  % 详解: 条件判断：if (nargin==0)
    f23 = Bound;  % 详解: 赋值：计算表达式并保存到 f23
else  % 详解: 条件判断：else 分支
aij=[4 4 4 4;  % 详解: 赋值：计算表达式并保存到 aij
     1 1 1 1;  % 详解: 执行语句
     8 8 8 8;  % 详解: 执行语句
     6 6 6 6;  % 详解: 执行语句
     3 7 3 7;  % 详解: 执行语句
     2 9 2 9;  % 详解: 执行语句
     5 5 3 3;  % 详解: 执行语句
     8 1 8 1;  % 详解: 执行语句
     6 2 6 2;  % 详解: 执行语句
     7 3.6 7 3.6];  % 详解: 执行语句
ci=[.1 .2 .2 .4 .4 .6 .3 .7 .5 .5];  % 详解: 赋值：计算表达式并保存到 ci

 
f23=0;  % 详解: 赋值：计算表达式并保存到 f23

for i=1:10  % 详解: for 循环：迭代变量 i 遍历 1:10
    f23=f23+(norm(x-aij(i,:)').^2+ci(:,i))^-1;  % 赋值：设置变量 f23  % 详解: 赋值：计算表达式并保存到 f23  % 详解: 赋值：计算表达式并保存到 f23
end  % 详解: 执行语句

f23=-f23;  % 详解: 赋值：计算表达式并保存到 f23
end  % 详解: 执行语句
 








